# Python for Data Science & Analysis 
## Notes 3.1, SQL & Relational Databases

---

This module looks at a standardized way of using python with relational databases; and with SQL. 

Here we review the general method and looping over result sets; in the next section we look at looping over datasets to injest (ie., insert) data.

### Objectives
* import sqlite and connect to a local file database
* write a create table query
* write a insert and update query
* write a select query:
    * over all columns
    * over a subset of columns
    * over two tables
    * filters by rows 
    * subsets rows and aggregates

### Problem & Data Context

* You have been hired as a data scientist by: **a naval expidition company**

* Task: **investigate which passengers survived the Titanic shipwreck**

# Part 0: History of SQL & Relational Databases

## What is a Relation?

A *relation* is a technical name for a *table* -- a data structure made of rows and columns. 

(A common misunderstanding is that "relation" means foregin key).

## What is a Database?

A database is an organised collection of structured information

i.e. any storage of data which has a uniform schema.

A relational database has a uniform tabular structure.

### What is a Schema?

A blueprint for the structure of the data in a database. In particular, a schema describes the particular structure of tables in the database. 

Schemas can be enforced across the entire database: every piece of data in the database has a known schema up-front. 

Or, the data itself can be on-disk in any strucutre, with a schema imposed by *the query* (eg., spark).

## What is a Relational Database?

Data stored in tables; data is structured the same way on-disk. 

There may be relationships (links) between these tables (based on data common to each).

## How else can you store data?

Constrast a relational database, with a *file system* where each packet of data may have an *abitarily different* schema -- eg., `.docx`, `.png`.

Here there is no uniform structure (each peice has a very different structure); table-structure isn't enforced (or common).

## What are some examples of Relational Databases?

* postgres
* oracle
* mysql
* mariadb
* microsoft
    * sql sever

## When were relational databases first invented

* 60s -- E. F. Codd invented "Relational Algebra" (mathematics of SQL)
    * "Relation" (aka. Table)
    * IBM
* 70s -- teams outside IBM built the first one

## How do I interact/communicate with relational databases?

SQL: strucutred query langauge
* 1974 first version
* 1986 standardized 


Verbs:

* Data Manipulation 
    * `SELECT` <- reading
    * `INSERT` <- inserting
    * `UPDATE` <- editing
    * `DELETE` <- removing
* Data Defintion <- defining structure
* Data Control <- user permissions

SQL: strucutred query langauge

Verbs:

* Data Manipulation 
* Data Defintion 
    * `CREATE` <- create table
    * `ALTER` <- eg., add fields to a table
    * `DROP` <- remove table (, databases)
* Data Control

SQL: strucutred query langauge

Verbs:

* Data Manipulation 
* Data Defintion 
* Data Control
    * `GRANT` <- give a user permissions
    * `REVOKE` <- remove permissions

## How do I write SQL queries?

By convention, SQL keywords are written in capitals, and our custom names (identifiers) are written in lowercase:

```sql

CREATE TABLE tablename (
  id INT,
  location TEXT
);


INSERT INTO tablename VALUES
(1, "London"),
(2, "Manchester");


SELECT id, location FROM tbl WHERE id == 10;

SELECT * FROM table WHERE location IN ("London", "Manchester");```

# Part 1: SQLite

## What is SQLite?

SQLite is a relational database, but it has no database management program. 

You do not connect to some running program to create/query/etc. a database.

SQLite is a *flat file* database, meaning, the whole db is in one file. And, all db operations are run from your program.

## Why use SQLite?

* sqlite3 is a good demonstration db
    * uses SQL
    * no installation
    * follows "database python conventions"
        * learning sqlite3 helpful for abitary databases
* most used database in the world
    * (neary every device will have an installation)
        * eg., mobile apps, and even jupyter
    * highly performant "simple" database

Sqlite3's API follows a common pattern across most python database libraries, so it is convenient for demonstration.

However it is also a highly performant database library, which is used on billions of devices -- esp. with mobile apps, embedded & IOT devices, and small-medium sized websites.

#### Aside: Modern Hardware
Due to recent advances in RAM and CPU capacity (since, eg., 2017), procesing large amounts of data on a single machine with sqlite3 -- traditionally regarded as a *simple* database -- is now often more performant than the equivalent distributed solution.

#### Aside: Why insert CSV data into a database?

Here we create and insert some examples into a db to illustrate using a relational database.

# Part 2: Python DBs

## How do I import SQLite?

sqlite3 is already installed:

In [1]:
import sqlite3

ref: https://docs.python.org/3/library/sqlite3.html

## How does SQLite3 work?

NB. `ls` *lists* the current directory. On windows, use `dir`:

In [10]:
!ls

LIVE_01_JupyterReview.ipynb      NHS34_MyWorkbook.ipynb
LIVE_31_SQL.ipynb                NHS34_Overview.ipynb
LIVE_32_SQL_CSV.ipynb            NHS34_Workbook.ipynb
LIVE_33_Spark.ipynb              NHS34_Workbook_Solutions.ipynb
LIVE_33b_IntroSpark4Analysts.pdf Untitled.ipynb
LIVE_34_Pandas.ipynb             datasets
LIVE_411_EDA_Pandas.ipynb        images
LIVE_412_EDA_Visuals.ipynb       my_titanic.db
LIVE_413_EDA_Plotly.ipynb        reference
LIVE_42_Text.ipynb

It "connects" by *creating a file* which will store the data:

In [5]:
sqlite3.connect("titanic.db")

sqlite3 creates database *files* on-disk, eg., when we create a database (say, "titanic.db") we have a file called "titanic.db" on-disk:

In [6]:
!ls

LIVE_01_JupyterReview.ipynb      NHS34_MyWorkbook.ipynb
LIVE_31_SQL.ipynb                NHS34_Overview.ipynb
LIVE_32_SQL_CSV.ipynb            NHS34_Workbook.ipynb
LIVE_33_Spark.ipynb              NHS34_Workbook_Solutions.ipynb
LIVE_33b_IntroSpark4Analysts.pdf Untitled.ipynb
LIVE_34_Pandas.ipynb             datasets
LIVE_411_EDA_Pandas.ipynb        images
LIVE_412_EDA_Visuals.ipynb       my_titanic.db
LIVE_413_EDA_Plotly.ipynb        reference
LIVE_42_Text.ipynb               titanic.db

## How do I delete a database?

The `unlink` function *deletes a file*:

In [29]:
import os

if os.path.exists("titanic.db"):
    os.unlink("titanic.db") # if exists then remove/delete

...the reason for having this example *here* is so that we delete any prior "dbs", before running the examples below...

In [8]:
!ls

LIVE_01_JupyterReview.ipynb      NHS34_MyWorkbook.ipynb
LIVE_31_SQL.ipynb                NHS34_Overview.ipynb
LIVE_32_SQL_CSV.ipynb            NHS34_Workbook.ipynb
LIVE_33_Spark.ipynb              NHS34_Workbook_Solutions.ipynb
LIVE_33b_IntroSpark4Analysts.pdf Untitled.ipynb
LIVE_34_Pandas.ipynb             datasets
LIVE_411_EDA_Pandas.ipynb        images
LIVE_412_EDA_Visuals.ipynb       my_titanic.db
LIVE_413_EDA_Plotly.ipynb        reference
LIVE_42_Text.ipynb

## How do I create a db?

Create a database to hold some "titanic" data...

In [11]:
conn = sqlite3.connect("titanic.db")

The `Connection` object is mostly used for debugging and error handling.

`variable = library.method(input)`

`connect` will create a database file if it doesn't exist; otherwise, it will connect (ie., open) an existing file...

## Where are the database files?

By default, in the same directory as the script which created them.

We can list the current directory's contents:

In [4]:
from os import listdir, getcwd

print(getcwd())
print()
listdir('.')

/Users/michael/Dropbox/courses/znhspython/02x-DataAnalysis

['NHS34_MyWorkbook.ipynb',
 'LIVE_33_Spark.ipynb',
 'Untitled1.ipynb',
 '.DS_Store',
 'images',
 'Untitled.ipynb',
 'LIVE_413_EDA_Plotly.ipynb',
 'NHS34_Overview.ipynb',
 'datasets',
 'LIVE_32_SQL_CSV.ipynb',
 'LIVE_411_EDA_Pandas.ipynb',
 'LIVE_42_Text.ipynb',
 'NHS34_Workbook.ipynb',
 'LIVE_412_EDA_Visuals.ipynb',
 'LIVE_31_SQL.ipynb',
 'NHS34_Workbook_Solutions.ipynb',
 '.ipynb_checkpoints',
 'LIVE_01_JupyterReview.ipynb',
 'titanic.db',
 'LIVE_34_Pandas.ipynb',
 'reference']

Or just show the files which contain `db` in their name:

In [5]:
from glob import glob

glob('*.db*')

['titanic.db']

By convention developers end db files with: `.db .sqlite .db3 .sqlite3`.

`glob` is a technical term which means "searching for files by a pattern".

## How do I communicate/query?

The connection object above is just a connection to the file; if you want to query you need a cursor:

create a Cursor object

In [31]:

conn = sqlite3.connect("titanic.db") # creates the file
cur = conn.cursor() # tracks dataset, enables querying

<font size=3 color=red> important: *use* a cursor! (to execute queries)</span>

to perform SQL commands we can use the `.execute()` method

In [32]:
cur.execute('CREATE TABLE data (x INT, y INT);');

...create a table called `data` with columns (x, y)...

In [33]:
cur.execute('INSERT INTO data VALUES (0, 0), (1, 2), (3, 5)');

...insert three rows into `data`...

In [34]:
cur.execute('SELECT x, y FROM data').fetchall()

[(0, 0), (1, 2), (3, 5)]

...selecting all the rows from `data`...

## How do write a multi-line SQL query?

It's often convenient to write SQL across multiple lines, this requires a specifc multi-line string syntax:

```
SELECT 
    d.id,
    d.location AS city,
    c.price AS revenue,
    (c.loss + c.price) AS profit
FROM 
    data AS d
    costs AS c
```

Use triple quotes...

In [10]:
print('''
this
runs
across
many lines
''')

this
runs
across
many lines

In [21]:
cur.execute('''
INSERT INTO 
    data 
VALUES 
    (9, 8), 
    (7, 6), 
    (5, 4);
''');

In [13]:
cur.execute('''
SELECT 
    * 
FROM 
    data;
''').fetchall()

[(0, 0), (1, 2), (3, 5), (9, 8), (7, 6), (5, 4)]

## How do I ensure data has been saved to the db?

In [35]:
conn.commit()

## How do I finish using a database?

Commit the data, as above, and then `.close()`:

In [37]:
conn.close()

## How do I delete an existing db?

We can delete the db just by removing the file (`unlink` here means delete file).

In [38]:
# close the connection
conn.close()

The `unlink()` function deletes a file:

In [39]:
os.unlink('titanic.db')

## How do I use SQLite3 in-full?

In [43]:
import sqlite3
import os 

# step 0. remove existing databases if needed
os.unlink("titanic.db")

# step 1. connect
conn = sqlite3.connect("titanic.db") 

# step 2. get a cursor
cur = conn.cursor()

# step 3. run the query
cur.execute('CREATE TABLE data (x INT, y INT)')
cur.execute('INSERT INTO data VALUES (10, 20), (30, 40)')
print(cur.execute('SELECT * FROM data').fetchall())

# step 4. commit *on the connection* to save any changes
conn.commit()

# step 5. close the connection
conn.close()

[(10, 20), (30, 40)]

## Exercise (15min)

Starting with the code above as the key example,

* Create a database to hold some data points in a data table
* Insert data points 
* Select and show them
* Commit, Close the connection on the DB
* EXTRA:
    * add a text field to the data table when you create it
    * select a groupby on that text field

# Part 3: Working with a Dataset

## What is the titanic dataset?

The titanic dataset describes the passengers on the titanic, including whether they survived.

In [44]:
import pandas as pd

pd.read_csv('datasets/titanic.csv')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

...we will look at this data set later, for now we're going to create a database for working with it...

## How do I create a table?

In [11]:
import os
os.unlink('titanic.db')

conn = sqlite3.connect("titanic.db")
cur = conn.cursor()

cur.execute('''
CREATE TABLE titanic (
    id INT PRIMARY KEY,
    survived INT,
    sex TEXT,
    age FLOAT,
    fare FLOAT,
    class TEXT
);
''');

Here we define a table just to hold a few columns of the dataset above.

## How do I insert data into a table?

In [12]:
cur.execute('''
INSERT INTO 
    titanic 
VALUES
    (1, 0, "male", 22.0, 7.2500, "Third"),
    (2, 1, "female", 38.0, 71.28, "First");
''');

## How do I select data from a table?

With queries that return information, the rows are not returned until you request them.

In [54]:
cur.execute('SELECT * FROM titanic')

You can request them:
* `.fetchall`, all at once 
    * load all results into memory
    * eg., 100 GB -> one machine?
* `for` loop
    * loads one row at a time
    * process row-by-row

In [55]:
results = cur.execute('SELECT * FROM titanic')

results.fetchall()

[(1, 0, 'male', 22.0, 7.25, 'Third'), (2, 1, 'female', 38.0, 71.28, 'First')]

Aside: by default `execute` returns an *iterator* which  behaves like a collection (eg., list) but "runs out" and only provides one element at a time.

`.fetchall()` converts the iterator into a list, which stores all data in memory -- so you can loop over it as many times as you like.

## How do I loop over a result set in python?

In [58]:
results = cur.execute('SELECT * FROM titanic') # NOTE: no `.fetchall`

# for LABEL in dataset: 
for row in results:
    # row = (1, 0, 'male', 22.0, 7.25, 'Third') 
    # row = (2, 1, 'female', 38.0, 71.28, 'First')
    
    print(row[0], row[-1])

1 Third
2 First

The dataset we get out, in `row`, is a tuple -- to access elements of this tuple (ie., the columns of the db) we have use an index.

Eg., `row[0]` is the `id` column.

## How can I assign field names in a for loop?

In [60]:
dataset = [
    (1, 0, 'male', 22.0, 7.25, 'Third'),
    (2, 1, 'female', 38.0, 71.28, 'First')
]

for row in dataset:
    # row = (1, 0, 'male', 22.0, 7.25, 'Third') 
    # row = (2, 1, 'female', 38.0, 71.28, 'First')
    print(row[0])

print()
for pid, psurvived, psex, page, pfare, pclass in dataset:
    print(psurvived)

1
2

0
1

In [62]:
results = cur.execute('SELECT * FROM titanic');

for pid, psurvived, psex, page, pfare, pclass in results:
    print(psurvived, psex)

0 male
1 female

Recall we need to close & commit:

In [13]:
conn.commit()
conn.close()

## EXTRA: How can I obtain rows as dictionaries?

Some databases allow you to obtain a dictionary for each row, this can be more convenient to use.

In [17]:
import sqlite3
con = sqlite3.connect('titanic.db')

# new line: this changes how rows are created
# returns a Row object, which is more like a dictionary

con.row_factory = sqlite3.Row


cur = con.cursor()
res = cur.execute('SELECT * FROM titanic')

for row in res:
    print(row['survived'], row['sex'])
    
con.commit()
con.close()

0 male
1 female

Aside: other databases require you to write
```python
cur = con.cursor(dictionary=True) # add the dictionary option
```

## How do I loop more than once?

If you run the loop a second time, you will not see any data:

In [68]:
results = cur.execute('SELECT * FROM titanic')

for pid, psurvived, psex, page, pfare, pclass in results:
    print("first", psurvived, psex)
    
    
# results = cur.execute('SELECT * FROM titanic')
print()
for pid, psurvived, psex, page, pfare, pclass in results:
    print("second", psurvived, psex)

first 0 male
first 1 female

A second loop would work if you used `.fetchall()`, but looping over the raw results set is *actually* just moving a cursor along the file... at the end of the first loop, the cursor is at the end of the result set -- so you cannot reloop.

## How do I update existing data?

In [70]:
before = cur.execute('SELECT * FROM titanic WHERE id = 1')

print(before.fetchall())

[(1, 0, 'male', 22.0, 7.25, 'Third')]

In [71]:
cur.execute('UPDATE titanic SET survived = 1 WHERE id = 1')

In [73]:
after = cur.execute('SELECT * FROM titanic WHERE id = 1')

print(after.fetchall())

[(1, 1, 'male', 22.0, 7.25, 'Third')]

## How do I filter the data I select?

In [74]:
after = cur.execute('''
SELECT 
    AVG(fare) 
FROM 
    titanic 
WHERE 
    age >= 18
''')

print(after.fetchall())

[(39.265,)]

## How do I obtain aggregate data?

In [75]:
after = cur.execute('''
SELECT 
    class, 
    AVG(fare) 
FROM titanic 
GROUP BY class
''')

print(after.fetchall())

[('First', 71.28), ('Third', 7.25)]

## How do I select data from multiple tables?

In [76]:
cur.execute('''
CREATE TABLE classes (
    class text,
    location text
);
''')

In [77]:
cur.execute('''
INSERT INTO classes VALUES 
    ("First", "London"),
    ("Second", "Liverpool"),
    ("Third", "Portsmouth");
''')

In [80]:
before = cur.execute('''
    SELECT t.age, t.sex, c.location 
    FROM titanic AS t
    JOIN classes AS c
    ON t.class = t.class
''')

print(before.fetchall())

[(22.0, 'male', 'London'), (22.0, 'male', 'Liverpool'), (22.0, 'male', 'Portsmouth'), (38.0, 'female', 'London'), (38.0, 'female', 'Liverpool'), (38.0, 'female', 'Portsmouth')]

### Exercise (20 min)

#### Problem Context

* You have been hired as a data scientist by: **a naval expedition company**. 

* Problem: **investigate which passengers survived the Titanic shipwreck**


* Goal: to create the data infrastructure to store titanic data. 
    * ie., to create an sqlite3 db with the right columns

In [3]:
import pandas as pd

pd.read_csv('datasets/titanic.csv').sample(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
870,0,3,male,26.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
547,1,2,male,NaN,0,0,13.8625,C,Second,man,True,NaN,Cherbourg,yes,True
713,0,3,male,29.0,0,0,9.4833,S,Third,man,True,NaN,Southampton,no,True

#### Questions

* create a database called `my_titanic.db`
    * HINT: `import`, `connect`

* create a table the following fields:
    * survived	
    * pclass
    * sex
    * age
    * fare
    * class
    * adult_male
    * embark_town
* EXTRA:
    * include all the fields
* HINT:
    * `TEXT`, `INT`, `FLOAT`

* insert exampe data
    * review the table above and, by hand, 
    * insert a few example rows which match
    * HINT: `execute`, `INSERT`

* produce a report on your sample data
    * query to include:
        * insert, select, 
        * HINT: `SELECT`, `for row in results`, `print()`
    * EXTRA:
        * update, group by
            * e.g. group by class